TOKEN = '5741116247:AAEQ-F3Eu10Ewvi924WzSqx-5zVjyv4i6dk'  # Bot token
GAME_SIZE = 2
RULES = 'Кто первый наберет 40 очков бросая кубики'
FIELD_EXTERNAL = (50, 1998)
FIELD_INTERIOR = (311, 1737)
HOME_WIDTH = 59
FIELD_PATH = './img/field.JPEG'
CHIP1_PATH = './img/chip1.png'
CHIP2_PATH = './img/chip2.png'
CHIP3_PATH = './img/chip3.png'
CHIP4_PATH = './img/chip4.png'

STREETS_PATH = './streets.txt'
CHIP_SIZE = 75
street_dict = {0: 'start', 1: 0, 2: 'prize', 3: 1, 4: 'tax', 5: 22, 6: 2, 7: 'penalty', 8: 3, 9: 4, 10: 'prison', 11: 5,
               12: 26, 13: 6, 14: 7, 15: 23, 16: 8, 17: 'prize', 18: 9, 19: 10, 20: 'relax', 21: 11, 22: 'penalty',
               23: 12, 24: 13, 25: 24, 26: 14, 27: 15, 28: 27, 29: 16, 30: 'go to prison', 31: 17, 32: 18, 33: 'prize',
               34: 19, 35: 25, 36: 'penalty', 37: 20, 38: 'super tax', 39: 21}
street_img_edge = [(54, 70, 289, 453), (337, 70, 571, 453), (634, 71, 870, 452), (914, 70, 1150, 451),
                   (1206, 70, 1443, 452), (1486, 69, 1722, 452), (1768, 70, 2003, 452), (54, 491, 285, 869),
                   (336, 494, 568, 869), (635, 495, 868, 869), (916, 495, 1147, 869), (1206, 492, 1442, 870),
                   (1488, 492, 1722, 870), (1769, 492, 2002, 870), (55, 921, 288, 1300), (337, 921, 571, 1300),
                   (634, 920, 865, 1297), (918, 921, 1147, 1294), (1207, 923, 1438, 1295), (1490, 924, 1723, 1295),
                   (1768, 925, 2003, 1295), (54, 1340, 291, 1719), (338, 1340, 573, 1719), (633, 1341, 868, 1718),
                   (914, 1341, 1151, 1720), (1206, 1340, 1442, 1719), (1486, 1341, 1722, 1719),
                   (1767, 1341, 2004, 1715)]
street_img_path = './img/streets.JPEG'
street_size = 150
street_lenght = 15
name_pedding = 70
house_size = 30
house_img_path = './img/house.png'
